Repository: PostgresGUI/postgresgui
Catalog: PostgresGUI/Localizable.xcstrings
Source language: en
Languages: de

# %@, %lld tables
source: %1$@, %2$lld tables
de: %1$@, %2$lld Tabellen

source: %lld row(s) will be exported
de: %lld Zeile(n) werden exportiert.

source: %lld rows
de: %lld Zeilen

source: ⚠️ Select DB
de: ⚠️ Datenbank auswählen

source: Add Connection Name
de: Verbindungsnamen eingeben

source: Are you sure you want to delete '%@'? This action cannot be undone.
de: Möchten Sie ‚%@‘ wirklich löschen? Diese Aktion kann nicht rückgängig gemacht werden.

source: Are you sure you want to delete "%@"? This action cannot be undone.
de: Möchten Sie ‚%@‘ wirklich löschen? Diese Aktion kann nicht rückgängig gemacht werden.

source: Are you sure you want to delete %lld folders?
de: Möchten Sie %lld Ordner wirklich löschen?

source: Are you sure you want to delete %lld queries? This action cannot be undone.
de: Möchten Sie %lld Abfragen wirklich löschen? Diese Aktion kann nicht rückgängig gemacht werden.

source: Are you sure you want to delete %lld row(s)? This action cannot be undone.
de: Möchten Sie %lld Zeile(n) wirklich löschen? Diese Aktion kann nicht rückgängig gemacht werden.

source: Are you sure you want to delete the folder "%@"?
de: Möchten Sie den Ordner „%@“ wirklich löschen?

source: Are you sure you want to drop "%@"? This will permanently delete the table and all its data. This action cannot be undone.
de: Möchten Sie „%@“ wirklich löschen? Dadurch werden die Tabelle und alle darin enthaltenen Daten dauerhaft gelöscht. Diese Aktion kann nicht rückgängig gemacht werden.

source: Are you sure you want to truncate "%@"? This will delete all rows in the table. This action cannot be undone.
de: Möchten Sie „%@“ wirklich leeren? Dadurch werden alle Zeilen in der Tabelle gelöscht. Diese Aktion kann nicht rückgängig gemacht werden.

source: Cancel
de: Abbrechen

source: Cannot delete selected database
de: Ausgewählte Datenbank kann nicht gelöscht werden.

source: Click 'Fetch Data' to load the table contents.
de: Klicken Sie auf „Daten abrufen“, um den Tabelleninhalt zu laden.

source: Close Tab
de: Tab schließen

source: Columns: %@
de: Spalten: %@

source: Connect
de: Verbinden

source: Connect now?
de: Jetzt verbinden?

source: Connect to Server...
de: Mit Server verbinden

source: Connected
de: Verbunden

source: Connection Created
de: Verbindung erstellt

source: Connection Error
de: Verbindungsfehler

source: Connection Failed
de: Verbindung fehlgeschlagen

source: Connection failed. %@
de: Verbindung fehlgeschlagen. %@

source: Connection String
de: Verbindungs-URL

source: Connection string is read-only when editing
de: Die Verbindungs-URL ist beim Bearbeiten schreibgeschützt.

source: Connection successful
de: Verbindung erfolgreich

source: Connections
de: Verbindungen

source: Copied!
de: Kopiert!

source: Copy connection string
de: Verbindungs-URL kopieren

source: Copy DDL
de: DDL kopieren

source: Copy JSON
de: Als JSON kopieren

source: Create
de: Erstellen

source: Create Database
de: Datenbank erstellen

source: Create New Connection
de: Neue Verbindung erstellen

source: Create your first connection to get started
de: Erstelle eine Verbindung, um loszulegen.

source: Database
de: Datenbank

source: Database created
de: Datenbank erstellt

source: Database Name
de: Datenbankname

source: Date Format
de: Datumsformat

source: Default
de: Standard

source: Delete
de: Löschen

source: Delete %lld Folders?
de: %lld Ordner löschen?

source: Delete %lld Folders...
de: %lld Ordner löschen…

source: Delete %lld Queries?
de: %lld Abfragen löschen?

source: Delete %lld Queries...
de: %lld Abfragen löschen…

source: Delete connection
de: Verbindung löschen

source: Delete Connection?
de: Verbindung löschen?

source: Delete database
de: Datenbank löschen

source: Delete Database?
de: Datenbank löschen?

source: Delete Folder and Queries
de: Ordner und Abfragen löschen

source: Delete Folder Only
de: Nur Ordner löschen

source: Delete Folder?
de: Ordner löschen?

source: Delete Folder...
de: Ordner löschen

source: Delete Folders and Queries
de: Ordner und Abfragen löschen

source: Delete Folders Only
de: Nur Ordner löschen

source: Delete Query?
de: Abfrage löschen?

source: Delete Query...
de: Abfrage löschen

source: Delete Rows?
de: Zeilen löschen?

source: Delete selected rows
de: Ausgewählte Zeile löschen

source: Delete...
de: Löschen

source: Dismiss connection status
de: Verbindungsstatus verwerfen

source: Done
de: Fertig

source: Download CSV
de: Als CSV herunterladen

source: Drop
de: Löschen

source: Drop Table?
de: Tabelle löschen?

source: Drop...
de: Löschen

source: Duplicate
de: Duplizieren

source: Edit connection
de: Verbindung bearbeiten

source: Edit Connection
de: Verbindung bearbeiten

source: Edit Row
de: Zeile bearbeiten

source: Edit selected row
de: Ausgewählte Zeile bearbeiten

source: Edit...
de: Bearbeiten

source: Error
de: Fehler

source: Error Deleting Connection
de: Fehler beim Löschen der Verbindung

source: Error Deleting Database
de: Fehler beim Löschen der Datenbank

source: Error Saving Row
de: Fehler beim Speichern der Zeile

source: Error Viewing JSON
de: Fehler beim Anzeigen von JSON

source: Export - %@
de: Exportieren - %@

source: Export %@
de: Als %@ exportieren

source: Export...
de: Exportieren

source: Failed to Save Query
de: Fehler beim Speichern der Abfrage

source: Fetch Data
de: Daten abrufen

source: Fetching table data...
de: Tabellendaten werden abgerufen...

source: Filter queries
de: Abfragen filtern

source: Filter results
de: Ergebnisse filtern

source: Folder name
de: Ordnername

source: Folder Name
de: Ordnername

source: Generate DDL
de: DDL generieren

source: Hello, and welcome!
de: Hallo und herzlich willkommen!

source: Help and Support
de: Hilfe und Support

source: Help and Support...
de: Hilfe und Support

source: Hide password
de: Passwort ausblenden

source: JSON View
de: Als JSON anzeigen

source: Keyboard Shortcuts
de: Tastaturkürzel

source: Keyboard Shortcuts...
de: Tastaturkürzel

source: Keychain Access Denied
de: Zugriff auf Schlüsselbund verweigert

source: Last Executed: %@
de: Zuletzt ausgeführt: %@

source: Load more (%lld remaining)
de: Mehr laden (%lld verbleibend)

source: Loading results...
de: Ergebnisse laden…

source: Loading Tables Timed Out
de: Zeitüberschreitung beim Laden der Tabellen

source: Loading tables took longer than %lld seconds. The database may be slow or unresponsive.
de: Das Laden der Tabellen hat länger als %lld Sekunden gedauert. Die Datenbank ist möglicherweise langsam oder reagiert nicht.

# loading.connecting
source: Connecting to database…
de: Verbindung zur Datenbank wird hergestellt…

# loading.initializing
source: Initializing…
de: Wird initialisiert…

# loading.loading_databases
source: Loading databases…
de: Datenbanken werden geladen…

# loading.loading_tables
source: Loading tables…
de: Tabellen werden geladen…

# loading.restoring_tabs
source: Restoring tabs…
de: Tabs werden wiederhergestellt…

source: Move %lld Queries to Folder
de: %lld-Abfragen in Ordner verschieben

source: Move %lld to Folder...
de: %lld in Ordner verschieben...

source: Move Query to Folder
de: Abfrage in Ordner verschieben

source: Move to Folder...
de: In Ordner verschieben

source: New Connection
de: Neue Verbindung

source: New Folder...
de: Neuer Ordner

source: New Tab
de: Neuer Tab

source: No columns found
de: Keine Spalten gefunden

source: No connections
de: Keine Verbindungen

source: No Connections
de: Keine Verbindungen

source: No Data
de: Keine Daten

source: No Database Selected
de: Keine Datenbank ausgewählt

source: No databases
de: Keine Datenbanken

source: No Folder
de: Keine Ordner

source: No matching queries
de: Keine passenden Suchanfragen

source: No results found
de: Keine Ergebnisse gefunden

source: No rows found
de: Keine Zeilen gefunden

source: No saved queries
de: Keine gespeicherten Abfragen

source: No tables found
de: Keine Tabellen gefunden

source: Not Now
de: Nicht jetzt

source: Page %lld
de: Seite %lld

source: Password
de: Passwort

source: PostgresGUI Help
de: PostgresGUI Hilfe

source: Preview
de: Vorschau

source: Primary Key
de: Primärschlüssel

source: Queries
de: Abfragen

source: Query Failed
de: Abfrage fehlgeschlagen

source: Query Name
de: Abfragename

source: Query Timed Out
de: Zeitüberschreitung bei der Abfrage

# query_sort.created_asc
source: Created (Oldest)
de: Erstellt (älteste zuerst)

# query_sort.created_desc
source: Created (Newest)
de: Erstellt (neueste zuerst)

# query_sort.updated_asc
source: Updated (Oldest)
de: Aktualisiert (älteste zuerst)

# query_sort.updated_desc
source: Updated (Newest)
de: Aktualisiert (neueste zuerst)

source: Ready to export %@
de: Bereit zum Exportieren von „%@“

source: Refresh
de: Aktualisieren

source: Remove custom name
de: Benutzerdefinierten Namen entfernen

source: Rename Folder
de: Ordner umbenennen

source: Rename Query
de: Abfrage umbenennen

source: Rename...
de: Unbenennen

source: Run a query to see results
de: Abfrage ausführen, um Ergebnisse anzuzeigen.

source: Run Query
de: Abfrage ausführen

source: Save
de: Speichern

source: Schema Error
de: Schemafehler

source: Select a database from the sidebar before running queries.
de: Vor dem Ausführen von Abfragen eine Datenbank in der Seitenleiste auswählen.

source: Settings
de: Einstellungen

source: Shortcuts
de: Abkürzungen

source: Show 100 Rows
de: 100 Zeilen anzeigen

source: Show All Rows
de: Alle Zeilen anzeigen

source: Show password
de: Passwort einblenden

source: Some servers do not support SSL/TLS. Use Disable only on trusted networks.
de: Manche Server unterstützen SSL/TLS nicht. Deaktivieren Sie SSL/TLS nur in vertrauenswürdigen Netzwerken.

source: SSL Mode
de: SSL-Modus

# ssl_mode.allow
source: Allow
de: Zulassen

# ssl_mode.disable
source: Disable
de: Deaktivieren

# ssl_mode.prefer
source: Prefer
de: Bevorzugen

# ssl_mode.require
source: Require
de: Erforderlich

# ssl_mode.verify_ca
source: Verify CA
de: CA prüfen

# ssl_mode.verify_full
source: Verify Full
de: Vollständig prüfen

source: Test
de: Testen

source: Testing connection
de: Verbindung testen

source: Testing connection...
de: Verbindung testen…

# The folder "%@" contains %lld queries. What would you like to do?
source: The folder "%1$@" contains %2$lld queries. What would you like to do?
de: Der Ordner „%1$@“ enthält %2$lld Abfragen. Was möchten Sie tun?

source: The query took longer than %lld seconds. The database may be slow or unresponsive.
de: Die Abfrage dauerte länger als %lld Sekunden. Die Datenbank ist möglicherweise langsam oder reagiert nicht.

# These %lld folders contain %lld queries total. What would you like to do?
source: These %1$lld folders contain %2$lld queries total. What would you like to do?
de: Diese %1$lld Ordner enthalten insgesamt %2$lld Abfragen. Was möchten Sie tun?

source: This table has no rows to export.
de: Diese Tabelle enthält keine zu exportierenden Zeilen.

source: Truncate
de: Leeren

source: Truncate Table?
de: Tabelle leeren?

source: Truncate...
de: Leeren

source: Try Again
de: Erneut versuchen

source: Type
de: Typ

source: Use Connection String
de: Verbindungs-URL verwenden

source: Username
de: Benutzername

source: View Connection String
de: Verbindungs-URL anzeigen

source: View selected rows as JSON
de: Ausgewählte Zeilen als JSON anzeigen

source: View Table
de: Tabelle anzeigen
